def color(name):
    colors = {
        "Z" : "\033[1;31m",  # احمر
        "B" : "\033[1;30m",  # أسود
        "L" : "\033[1;95m",  # ارجواني
        "R" : "\033[1;31m",  # أحمر
        "G" : "\033[1;32m",  # أخضر
        "Y" : "\033[1;33m",  # أصفر
        "Bl" : "\033[1;34m", # أزرق
        "P" : "\033[1;35m",  # بنفسجي
        "C" : "\033[1;36m",  # سماوي
        "W" : "\033[1;37m",  # أبيض
        "E" : "\033[0;90m",  # رمادي
        "re" : "\033[0m"     # إعادة تعيين اللون
    }
    return colors[f"{name}"]